/*	$NetBSD: lfs.h,v 1.208 2020/03/28 01:08:42 christos Exp $	*/

/*  from NetBSD: dinode.h,v 1.25 2016/01/22 23:06:10 dholland Exp  */
/*  from NetBSD: dir.h,v 1.25 2015/09/01 06:16:03 dholland Exp  */

/*-
 * Copyright (c) 1999, 2000, 2001, 2002, 2003 The NetBSD Foundation, Inc.
 * All rights reserved.
 *
 * This code is derived from software contributed to The NetBSD Foundation
 * by Konrad E. Schroder <perseant@hhhh.org>.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
 * TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
 * BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS

 *      directory block is tucked away within an existing entry.
 *    - all space within a directory block is part of some entry.
 *    - therefore, inserting a new entry requires finding and
 *      splitting a suitable existing entry, and when entries are
 *      removed their space is merged into the entry ahead of them.
 *    - an empty/unused entry has d_ino set to 0. This normally only
 *      appears in the first entry in a block, as elsewhere the unused
 *      entry should have been merged into the one before it. However,
 *      fsck leaves such entries behind so they must be tolerated
 *      elsewhere.
 *    - a completely empty directory block has one entry whose
 *      d_reclen is DIRBLKSIZ and whose d_ino is 0.
 *
 * The "old directory format" referenced by the fs->lfs_isolddirfmt
 * flag (and some other things) refers to when the type field was
 * added to directory entries. This change was made to FFS in the 80s,
 * well before LFS was first written; there should be no LFS volumes
 * (and certainly no LFS v2-format volumes or LFS64 volumes) where the
 * old format pertains. All of the related logic should probably be
 * removed; however, it hasn't been yet, and we get to carry it around
 * until we can be conclusively sure it isn't needed.
 *
 * In the "old directory format" there is no type field and the namlen
 * field is correspondingly 16 bits wide. On big-endian volumes this
 * has no effect: namlen cannot exceed 255, so the upper byte is
 * always 0 and this reads back from the type field as LFS_DT_UNKNOWN.
 * On little-endian volumes, the namlen field will always be 0 and
 * the namlen value needs to be read out of the type field. (The type
 * is always LFS_DT_UNKNOWN.) The directory accessor functions take
 * care of this so nothing else needs to be aware of it.
 *
 * LFS_OLDDIRFMT and LFS_NEWDIRFMT are code numbers for the old and
 * new directory format respectively. These codes do not appear on
 * disk; they're generated from a runtime macro called FSFMT() that's
 * cued by other things. This is why (confusingly) LFS_OLDDIRFMT is 1
 * and LFS_NEWDIRFMT is 0.
 *
 * FSFMT(), LFS_OLDDIRFMT, and LFS_NEWDIRFMT should be removed. (XXX)
 */

/*
 * Directory block size.
 */
#undef	LFS_DIRBLKSIZ
#define	LFS_DIRBLKSIZ	DEV_BSIZE

/*
 * Convert between stat structure type codes and directory entry type codes.
 */
#define	LFS_IFTODT(mode)	(((mode) & 0170000) >> 12)
#define	LFS_DTTOIF(dirtype)	((dirtype) << 12)

/*
 * Theoretically, directories can be more than 2Gb in length; however, in
 * practice this seems unlikely. So, we define the type doff_t as a 32-bit
 * quantity to keep down the cost of doing lookup on a 32-bit machine.
 */
#define	doff_t		int32_t
#define	lfs_doff_t	int32_t
#define	LFS_MAXDIRSIZE	(0x7fffffff)

/*
 * File types for d_type
 */
#define	LFS_DT_UNKNOWN	 0
#define	LFS_DT_FIFO	 1
#define	LFS_DT_CHR	 2
#define	LFS_DT_DIR	 4
#define	LFS_DT_BLK	 6
#define	LFS_DT_REG	 8
#define	LFS_DT_LNK	10
#define	LFS_DT_SOCK	12
#define	LFS_DT_WHT	14

/*
 * (See notes above)
 */

struct lfs_dirheader32 {
	uint32_t dh_ino;		/* inode number of entry */
	uint16_t dh_reclen;		/* length of this record */
	uint8_t  dh_type; 		/* file type, see below */
	uint8_t  dh_namlen;		/* length of string in d_name */
};
__CTASSERT(sizeof(struct lfs_dirheader32) == 8);

struct lfs_dirheader64 {
	uint64_t dh_ino;		/* inode number of entry */
	uint16_t dh_reclen;		/* length of this record */
	uint8_t  dh_type; 		/* file type, see below */
	uint8_t  dh_namlen;		/* length of string in d_name */
} __aligned(4) __packed;
__CTASSERT(sizeof(struct lfs_dirheader64) == 12);

union lfs_dirheader {
	struct lfs_dirheader64 u_64;
	struct lfs_dirheader32 u_32;
};
__CTASSERT(__alignof(union lfs_dirheader) == __alignof(struct lfs_dirheader64));
#ifndef __lint__
__CTASSERT(__alignof(union lfs_dirheader) == __alignof(struct lfs_dirheader32));
#endif

typedef union lfs_dirheader LFS_DIRHEADER;

/*
 * Template for manipulating directories.
 */

struct lfs_dirtemplate32 {
	struct lfs_dirheader32	dot_header;
	char			dot_name[4];	/* must be multiple of 4 */
	struct lfs_dirheader32	dotdot_header;
	char			dotdot_name[4];	/* ditto */
};
__CTASSERT(sizeof(struct lfs_dirtemplate32) == 2*(8 + 4));

struct lfs_dirtemplate64 {
	struct lfs_dirheader64	dot_header;
	char			dot_name[4];	/* must be multiple of 4 */
	struct lfs_dirheader64	dotdot_header;
	char			dotdot_name[4];	/* ditto */
};
__CTASSERT(sizeof(struct lfs_dirtemplate64) == 2*(12 + 4));

union lfs_dirtemplate {
	struct lfs_dirtemplate64 u_64;
	struct lfs_dirtemplate32 u_32;
};

#if 0
/*
 * This is the old format of directories, sans type element.
 */
struct lfs_odirtemplate {
	uint32_t	dot_ino;
	int16_t		dot_reclen;
	uint16_t	dot_namlen;
	char		dot_name[4];	/* must be multiple of 4 */
	uint32_t	dotdot_ino;
	int16_t		dotdot_reclen;
	uint16_t	dotdot_namlen;
	char		dotdot_name[4];	/* ditto */
};
__CTASSERT(sizeof(struct lfs_odirtemplate) == 2*(8 + 4));
#endif

/*
 * Inodes
 */

/*
 * A dinode contains all the meta-data associated with a LFS file.
 * This structure defines the on-disk format of a dinode. Since
 * this structure describes an on-disk structure, all its fields
 * are defined by types with precise widths.
 */

struct lfs32_dinode {
	uint16_t	di_mode;	/*   0: IFMT, permissions; see below. */
	int16_t		di_nlink;	/*   2: File link count. */
	uint32_t	di_inumber;	/*   4: Inode number. */
	uint64_t	di_size;	/*   8: File byte count. */
	int32_t		di_atime;	/*  16: Last access time. */
	int32_t		di_atimensec;	/*  20: Last access time. */
	int32_t		di_mtime;	/*  24: Last modified time. */
	int32_t		di_mtimensec;	/*  28: Last modified time. */
	int32_t		di_ctime;	/*  32: Last inode change time. */
	int32_t		di_ctimensec;	/*  36: Last inode change time. */
	int32_t		di_db[ULFS_NDADDR]; /*  40: Direct disk blocks. */
	int32_t		di_ib[ULFS_NIADDR]; /*  88: Indirect disk blocks. */
	uint32_t	di_flags;	/* 100: Status flags (chflags). */
	uint32_t	di_blocks;	/* 104: Blocks actually held. */
	int32_t		di_gen;		/* 108: Generation number. */
	uint32_t	di_uid;		/* 112: File owner. */
	uint32_t	di_gid;		/* 116: File group. */
	uint64_t	di_modrev;	/* 120: i_modrev for NFSv4 */
};
__CTASSERT(sizeof(struct lfs32_dinode) == 128);

struct lfs64_dinode {
	uint16_t	di_mode;	/*   0: IFMT, permissions; see below. */
	int16_t		di_nlink;	/*   2: File link count. */
	uint32_t	di_uid;		/*   4: File owner. */
	uint32_t	di_gid;		/*   8: File group. */
	uint32_t	di_blksize;	/*  12: Inode blocksize. */
	uint64_t	di_size;	/*  16: File byte count. */
	uint64_t	di_blocks;	/*  24: Bytes actually held. */
	int64_t		di_atime;	/*  32: Last access time. */
	int64_t		di_mtime;	/*  40: Last modified time. */
	int64_t		di_ctime;	/*  48: Last inode change time. */
	int64_t		di_birthtime;	/*  56: Inode creation time. */
	int32_t		di_mtimensec;	/*  64: Last modified time. */
	int32_t		di_atimensec;	/*  68: Last access time. */
	int32_t		di_ctimensec;	/*  72: Last inode change time. */
	int32_t		di_birthnsec;	/*  76: Inode creation time. */
	int32_t		di_gen;		/*  80: Generation number. */
	uint32_t	di_kernflags;	/*  84: Kernel flags. */
	uint32_t	di_flags;	/*  88: Status flags (chflags). */
	int32_t		di_extsize;	/*  92: External attributes block. */
	int64_t		di_extb[ULFS_NXADDR];/* 96: External attributes block. */
	int64_t		di_db[ULFS_NDADDR]; /* 112: Direct disk blocks. */
	int64_t		di_ib[ULFS_NIADDR]; /* 208: Indirect disk blocks. */
	uint64_t	di_modrev;	/* 232: i_modrev for NFSv4 */
	uint64_t	di_inumber;	/* 240: Inode number */
	uint64_t	di_spare[1];	/* 248: Reserved; currently unused */
};
__CTASSERT(sizeof(struct lfs64_dinode) == 256);

union lfs_dinode {
	struct lfs64_dinode u_64;
	struct lfs32_dinode u_32;
};
__CTASSERT(__alignof(union lfs_dinode) == __alignof(struct lfs64_dinode));
__CTASSERT(__alignof(union lfs_dinode) == __alignof(struct lfs32_dinode));

/*
 * The di_db fields may be overlaid with other information for
 * file types that do not have associated disk storage. Block
 * and character devices overlay the first data block with their
 * dev_t value. Short symbolic links place their path in the
 * di_db area.
 */
#define	di_rdev		di_db[0]

/* Size of the on-disk inode. */
//#define	LFS_DINODE1_SIZE	(sizeof(struct ulfs1_dinode))	/* 128 */
//#define	LFS_DINODE2_SIZE	(sizeof(struct ulfs2_dinode))

/* File types, found in the upper bits of di_mode. */
#define	LFS_IFMT	0170000		/* Mask of file type. */
#define	LFS_IFIFO	0010000		/* Named pipe (fifo). */
#define	LFS_IFCHR	0020000		/* Character device. */
#define	LFS_IFDIR	0040000		/* Directory file. */
#define	LFS_IFBLK	0060000		/* Block device. */
#define	LFS_IFREG	0100000		/* Regular file. */
#define	LFS_IFLNK	0120000		/* Symbolic link. */
#define	LFS_IFSOCK	0140000		/* UNIX domain socket. */
#define	LFS_IFWHT	0160000		/* Whiteout. */

/*
 * "struct buf" associated definitions
 */

/* Unassigned disk addresses. */
#define	UNASSIGNED	-1
#define UNWRITTEN	-2

/* Unused logical block number */
#define LFS_UNUSED_LBN	-1

/*
 * On-disk and in-memory checkpoint segment usage structure.
 */
typedef struct segusage SEGUSE;
struct segusage {
	uint32_t su_nbytes;		/* 0: number of live bytes */
	uint32_t su_olastmod;		/* 4: SEGUSE last modified timestamp */
	uint16_t su_nsums;		/* 8: number of summaries in segment */
	uint16_t su_ninos;		/* 10: number of inode blocks in seg */

#define	SEGUSE_ACTIVE		0x01	/*  segment currently being written */
#define	SEGUSE_DIRTY		0x02	/*  segment has data in it */
#define	SEGUSE_SUPERBLOCK	0x04	/*  segment contains a superblock */
#define SEGUSE_ERROR		0x08	/*  cleaner: do not clean segment */
#define SEGUSE_EMPTY		0x10	/*  segment is empty */
#define SEGUSE_INVAL		0x20	/*  segment is invalid */
	uint32_t su_flags;		/* 12: segment flags */
	uint64_t su_lastmod;		/* 16: last modified timestamp */
};
__CTASSERT(sizeof(struct segusage) == 24);

typedef struct segusage_v1 SEGUSE_V1;
struct segusage_v1 {
	uint32_t su_nbytes;		/* 0: number of live bytes */
	uint32_t su_lastmod;		/* 4: SEGUSE last modified timestamp */
	uint16_t su_nsums;		/* 8: number of summaries in segment */
	uint16_t su_ninos;		/* 10: number of inode blocks in seg */
	uint32_t su_flags;		/* 12: segment flags  */
};
__CTASSERT(sizeof(struct segusage_v1) == 16);

/*
 * On-disk file information.  One per file with data blocks in the segment.
 *
 * The FINFO structure is a header; it is followed by fi_nblocks block
 * pointers, which are logical block numbers of the file. (These are the
 * blocks of the file present in this segment.)
 */

typedef struct finfo64 FINFO64;
struct finfo64 {
	uint32_t fi_nblocks;		/* number of blocks */
	uint32_t fi_version;		/* version number */
	uint64_t fi_ino;		/* inode number */
	uint32_t fi_lastlength;		/* length of last block in array */
	uint32_t fi_pad;		/* unused */
} __aligned(4) __packed;
__CTASSERT(sizeof(struct finfo64) == 24);

typedef struct finfo32 FINFO32;
struct finfo32 {
	uint32_t fi_nblocks;		/* number of blocks */
	uint32_t fi_version;		/* version number */
	uint32_t fi_ino;		/* inode number */
	uint32_t fi_lastlength;		/* length of last block in array */
};
__CTASSERT(sizeof(struct finfo32) == 16);

typedef union finfo {
	struct finfo64 u_64;
	struct finfo32 u_32;
} FINFO;
__CTASSERT(__alignof(union finfo) == __alignof(struct finfo64));
#ifndef __lint__
__CTASSERT(__alignof(union finfo) == __alignof(struct finfo32));
#endif

/*
 * inode info (part of the segment summary)
 *
 * Each one of these is just a block number; wrapping the structure
 * around it gives more contextual information in the code about
 * what's going on.
 */

typedef struct iinfo64 {
	uint64_t ii_block;		/* block number */
} __aligned(4) __packed IINFO64;
__CTASSERT(sizeof(struct iinfo64) == 8);

typedef struct iinfo32 {
	uint32_t ii_block;		/* block number */
} IINFO32;
__CTASSERT(sizeof(struct iinfo32) == 4);

typedef union iinfo {
	struct iinfo64 u_64;
	struct iinfo32 u_32;
} IINFO;
__CTASSERT(__alignof(union iinfo) == __alignof(struct iinfo64));
#ifndef __lint__
__CTASSERT(__alignof(union iinfo) == __alignof(struct iinfo32));
#endif

/*
 * Index file inode entries.
 */

/* magic value for daddrs */
#define	LFS_UNUSED_DADDR	0	/* out-of-band daddr */
/* magic value for if_nextfree -- indicate orphaned file */
#define LFS_ORPHAN_NEXTFREE(fs) \
	((fs)->lfs_is64 ? ~(uint64_t)0 : ~(uint32_t)0)

typedef struct ifile64 IFILE64;
struct ifile64 {
	uint32_t if_version;		/* inode version number */
	uint32_t if_atime_nsec;		/* and nanoseconds */
	uint64_t if_atime_sec;		/* Last access time, seconds */
	int64_t	  if_daddr;		/* inode disk address */
	uint64_t if_nextfree;		/* next-unallocated inode */
} __aligned(4) __packed;
__CTASSERT(sizeof(struct ifile64) == 32);

typedef struct ifile32 IFILE32;
struct ifile32 {
	uint32_t if_version;		/* inode version number */
	int32_t	  if_daddr;		/* inode disk address */
	uint32_t if_nextfree;		/* next-unallocated inode */
	uint32_t if_atime_sec;		/* Last access time, seconds */
	uint32_t if_atime_nsec;		/* and nanoseconds */
};
__CTASSERT(sizeof(struct ifile32) == 20);

typedef struct ifile_v1 IFILE_V1;
struct ifile_v1 {
	uint32_t if_version;		/* inode version number */
	int32_t	  if_daddr;		/* inode disk address */
	uint32_t if_nextfree;		/* next-unallocated inode */
#if LFS_ATIME_IFILE
#error "this cannot work"
	struct timespec if_atime;	/* Last access time */
#endif
};
__CTASSERT(sizeof(struct ifile_v1) == 12);

/*
 * Note: struct ifile_v1 is often handled by accessing the first three
 * fields of struct ifile32. (XXX: Blah.  This should be cleaned up as
 * it may in some cases violate the strict-aliasing rules.)
 */
typedef union ifile {
	struct ifile64 u_64;
	struct ifile32 u_32;
	struct ifile_v1 u_v1;
} IFILE;
__CTASSERT(__alignof(union ifile) == __alignof(struct ifile64));
#ifndef __lint__
__CTASSERT(__alignof(union ifile) == __alignof(struct ifile32));
__CTASSERT(__alignof(union ifile) == __alignof(struct ifile_v1));
#endif

/*
 * Cleaner information structure.  This resides in the ifile and is used
 * to pass information from the kernel to the cleaner.
 */

/* flags for ->flags */
#define LFS_CLEANER_MUST_CLEAN	0x01

typedef struct _cleanerinfo32 {
	uint32_t clean;			/* 0: number of clean segments */
	uint32_t dirty;			/* 4: number of dirty segments */
	int32_t   bfree;		/* 8: disk blocks free */
	int32_t	  avail;		/* 12: disk blocks available */
	uint32_t free_head;		/* 16: head of the inode free list */
	uint32_t free_tail;		/* 20: tail of the inode free list */
	uint32_t flags;			/* 24: status word from the kernel */
} CLEANERINFO32;
__CTASSERT(sizeof(struct _cleanerinfo32) == 28);

typedef struct _cleanerinfo64 {
	uint32_t clean;			/* 0: number of clean segments */
	uint32_t dirty;			/* 4: number of dirty segments */
	int64_t   bfree;		/* 8: disk blocks free */
	int64_t	  avail;		/* 16: disk blocks available */
	uint64_t free_head;		/* 24: head of the inode free list */
	uint64_t free_tail;		/* 32: tail of the inode free list */
	uint32_t flags;			/* 40: status word from the kernel */
	uint32_t pad;			/* 44: must be 64-bit aligned */
} __aligned(4) __packed CLEANERINFO64;
__CTASSERT(sizeof(struct _cleanerinfo64) == 48);

/* this must not go to disk directly of course */
typedef union _cleanerinfo {
	CLEANERINFO32 u_32;
	CLEANERINFO64 u_64;
} CLEANERINFO;
#ifndef __lint__
__CTASSERT(__alignof(union _cleanerinfo) == __alignof(struct _cleanerinfo32));
__CTASSERT(__alignof(union _cleanerinfo) == __alignof(struct _cleanerinfo64));
#endif

/*
 * On-disk segment summary information
 */

/* magic value for ss_magic */
#define SS_MAGIC	0x061561

/* flags for ss_flags */
#define	SS_DIROP	0x01		/* segment begins a dirop */
#define	SS_CONT		0x02		/* more partials to finish this write*/
#define	SS_CLEAN	0x04		/* written by the cleaner */
#define	SS_RFW		0x08		/* written by the roll-forward agent */
#define	SS_RECLAIM	0x10		/* written by the roll-forward agent */

/* type used for reading checksum signatures from metadata structures */
typedef uint32_t lfs_checkword;

typedef struct segsum_v1 SEGSUM_V1;
struct segsum_v1 {
	uint32_t ss_sumsum;		/* 0: check sum of summary block */
	uint32_t ss_datasum;		/* 4: check sum of data */
	uint32_t ss_magic;		/* 8: segment summary magic number */
	int32_t	  ss_next;		/* 12: next segment */
	uint32_t ss_create;		/* 16: creation time stamp */
	uint16_t ss_nfinfo;		/* 20: number of file info structures */
	uint16_t ss_ninos;		/* 22: number of inodes in summary */
	uint16_t ss_flags;		/* 24: used for directory operations */
	uint16_t ss_pad;		/* 26: extra space */
	/* FINFO's and inode daddr's... */
};
__CTASSERT(sizeof(struct segsum_v1) == 28);

typedef struct segsum32 SEGSUM32;
struct segsum32 {
	uint32_t ss_sumsum;		/* 0: check sum of summary block */
	uint32_t ss_datasum;		/* 4: check sum of data */
	uint32_t ss_magic;		/* 8: segment summary magic number */
	int32_t	  ss_next;		/* 12: next segment (disk address) */
	uint32_t ss_ident;		/* 16: roll-forward fsid */
	uint16_t ss_nfinfo;		/* 20: number of file info structures */
	uint16_t ss_ninos;		/* 22: number of inodes in summary */
	uint16_t ss_flags;		/* 24: used for directory operations */
	uint8_t  ss_pad[2];		/* 26: extra space */
	uint32_t ss_reclino;		/* 28: inode being reclaimed */
	uint64_t ss_serial;		/* 32: serial number */
	uint64_t ss_create;		/* 40: time stamp */
	/* FINFO's and inode daddr's... */
} __aligned(4) __packed;
__CTASSERT(sizeof(struct segsum32) == 48);

typedef struct segsum64 SEGSUM64;
struct segsum64 {
	uint32_t ss_sumsum;		/* 0: check sum of summary block */
	uint32_t ss_datasum;		/* 4: check sum of data */
	uint32_t ss_magic;		/* 8: segment summary magic number */
	uint32_t ss_ident;		/* 12: roll-forward fsid */
	int64_t	  ss_next;		/* 16: next segment (disk address) */
	uint16_t ss_nfinfo;		/* 24: number of file info structures */
	uint16_t ss_ninos;		/* 26: number of inodes in summary */
	uint16_t ss_flags;		/* 28: used for directory operations */
	uint8_t  ss_pad[2];		/* 30: extra space */
	uint64_t ss_reclino;		/* 32: inode being reclaimed */
	uint64_t ss_serial;		/* 40: serial number */
	uint64_t ss_create;		/* 48: time stamp */
	/* FINFO's and inode daddr's... */
} __aligned(4) __packed;
__CTASSERT(sizeof(struct segsum64) == 56);

typedef union segsum SEGSUM;
union segsum {
	struct segsum64 u_64;
	struct segsum32 u_32;
	struct segsum_v1 u_v1;
};
__CTASSERT(__alignof(union segsum) == __alignof(struct segsum64));
__CTASSERT(__alignof(union segsum) == __alignof(struct segsum32));
#ifndef __lint__
__CTASSERT(__alignof(union segsum) == __alignof(struct segsum_v1));
#endif

/*
 * On-disk super block.
 *
 * We have separate superblock structures for the 32-bit and 64-bit
 * LFS, and accessor functions to hide the differences.
 *
 * For lfs64, the format version is always 2; version 1 lfs is old.
 * For both, the inode format version is 0; for lfs32 this selects the
 * same 32-bit inode as always, and for lfs64 this selects the larger
 * 64-bit inode structure we got from ffsv2.
 *
 * In lfs64:
 *   - inode numbers are 64 bit now
 *   - segments may not be larger than 4G (counted in bytes)
 *   - there may not be more than 2^32 (or perhaps 2^31) segments
